Дневник_Инвестора/src/InformationRegisters/ОчередьОбработкиЭмитентаАктива/ОчередьОбработкиЭмитентаАктива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбработкиЭмитентаАктива</name>
  <resources>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиОчередей</types>
    </type>
  </resources>
  <dimensions>
    <name>Актив</name>
    <type>
      <types>DefinedType.Актив</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЭмитента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дневник_Инвестора/src/Enums/СтатусыОбработкиОчередей/СтатусыОбработкиОчередей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработкиОчередей</name>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>НеОбработан</name>
  </enumValues>
</mdclass:Enum>

Дневник_Инвестора/src/InformationRegisters/ОчередьОбработкиЭмитентаАктива/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создать новую запись.
// 
// Параметры:
//  ПараметрыЗаписи - см. НовыйПараметрыЗаписи
//
Процедура СоздатьНовуюЗапись(ПараметрыЗаписи) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Заполнить(ПараметрыЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Новый параметры записи.
// 
// Возвращаемое значение:
//  Структура - Новый параметры записи:
// * Актив - Неопределено 
// * ИдентификаторЭмитента - Строка
// * СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиОчередей
//
Функция НовыйПараметрыЗаписи() Экспорт
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Актив", Неопределено);
	ПараметрыЗаписи.Вставить("ИдентификаторЭмитента", "");
	ПараметрыЗаписи.Вставить("СтатусОбработки", Перечисления.СтатусыОбработкиОчередей.НеОбработан);
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
